OpenFOAM-11/tutorials/incompressibleFluid/blockedChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 -16 -1) (256 -16 -1)
    (0  16 -1) (256  16 -1)
    (0 -16  1) (256 -16  1)
    (0  16  1) (256  16  1)

    (0 -52 -1) ( 32 -52 -1) (64 -44 -1) (128 -44 -1) (224 -52 -1) (256 -52 -1)
    (0 -20 -1) ( 32 -20 -1) (64 -28 -1) (128 -28 -1) (224 -20 -1) (256 -20 -1)
    (0 -52  1) ( 32 -52  1) (64 -44  1) (128 -44  1) (224 -52  1) (256 -52  1)
    (0 -20  1) ( 32 -20  1) (64 -28  1) (128 -28  1) (224 -20  1) (256 -20  1)

    (0 -88 -1) (256 -88 -1)
    (0 -56 -1) (256 -56 -1)
    (0 -88  1) (256 -88  1)
    (0 -56  1) (256 -56  1)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (256 32 1) simpleGrading (1 1 1)

    hex (8 9 15 14 20 21 27 26) (32 32 1) simpleGrading (1 1 1)
    hex (9 10 16 15 21 22 28 27) (32 32 1) simpleGrading (1 1 1)
    hex (10 11 17 16 22 23 29 28) (32 32 1) simpleGrading (1 1 1)
    hex (11 12 18 17 23 24 30 29) (96 32 1) simpleGrading (1 1 1)
    hex (12 13 19 18 24 25 31 30) (64 32 1) simpleGrading (1 1 1)

    hex (32 33 35 34 36 37 39 38) (256 32 1) simpleGrading (1 1 1)
);

defaultPatch
{
    name frontAndBack;
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 2 6 4)

            (8 14 26 20)

            (32 34 38 36)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 3 7 5)

            (13 19 31 25)

            (33 35 39 37)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)

            (8 9 21 20)
            (9 10 22 21)
            (10 11 23 22)
            (11 12 24 23)
            (12 13 25 24)
            (14 15 27 26)
            (15 16 28 27)
            (16 17 29 28)
            (17 18 30 29)
            (18 19 31 30)

            (32 33 37 36)
            (34 35 39 38)
        );
    }
);

// ************************************************************************* //
